[
  {
    "q": "Who won the 2010 FIFA World Cup?",
    "a": "Spain"
  },
  {
    "q": "Which player is known as 'The Divine Ponytail'?",
    "a": "Roberto Baggio"
  },
  {
    "q": "Who scored the 'Hand of God' goal?",
    "a": "Diego Maradona"
  },
  {
    "q": "Which club has won the most UEFA Champions League titles?",
    "a": "Real Madrid"
  },
  {
    "q": "Who is the all-time top scorer in the English Premier League?",
    "a": "Alan Shearer"
  },
  {
    "q": "Which stadium is nicknamed 'The Theatre of Dreams'?",
    "a": "Old Trafford"
  },
  {
    "q": "Who was the captain of France’s 1998 World Cup winning team?",
    "a": "Didier Deschamps"
  },
  {
    "q": "Who scored the fastest goal in World Cup history?",
    "a": "Hakan Şükür (11 seconds, 2002)"
  },
  {
    "q": "Which African country was the first to host the FIFA World Cup?",
    "a": "South Africa (2010)"
  },
  {
    "q": "Who has won the Ballon d'Or the most times?",
    "a": "Lionel Messi"
  },
  {
    "q": "Which team famously lost the Premier League in 2011-12 due to a last-minute Agüero goal?",
    "a": "Manchester United"
  },
  {
    "q": "Who is Brazil’s all-time top goal scorer?",
    "a": "Pele"
  },
  {
    "q": "Which country won the first ever FIFA World Cup (1930)?",
    "a": "Uruguay"
  },
  {
    "q": "Which England striker scored a hat-trick in the 1966 World Cup final?",
    "a": "Geoff Hurst"
  },
  {
    "q": "Which Italian club is known as 'The Old Lady'?",
    "a": "Juventus"
  },
  {
    "q": "Which player received the most red cards in his career?",
    "a": "Gerardo Bedoya"
  },
  {
    "q": "Who scored the only goal in the 2010 World Cup final?",
    "a": "Andrés Iniesta"
  },
  {
    "q": "Which club’s rivalry is known as 'El Clásico'?",
    "a": "Real Madrid vs. Barcelona"
  },
  {
    "q": "Who was Germany's winning World Cup captain in 2014?",
    "a": "Philipp Lahm"
  },
  {
    "q": "Which African country reached the World Cup quarterfinals for the first time in 1990?",
    "a": "Cameroon"
  },
  {
    "q": "Which Dutch club's academy produced Johan Cruyff?",
    "a": "Ajax"
  },
  {
    "q": "Which player is known for a ‘Panenka’ penalty?",
    "a": "Antonín Panenka"
  },
  {
    "q": "Which English manager won the Premier League with Leicester City?",
    "a": "Claudio Ranieri"
  },
  {
    "q": "Who is the only footballer to have played in a Super Bowl and a World Cup?",
    "a": "None – trick question"
  },
  {
    "q": "Who won the first ever Women's Ballon d'Or?",
    "a": "Ada Hegerberg"
  },
  {
    "q": "What is the maximum number of substitutions allowed per team in regular Premier League match (as of 2023)?",
    "a": "Five"
  },
  {
    "q": "Who won the Champions League three times as a manager with the same club?",
    "a": "Zinedine Zidane (Real Madrid)"
  },
  {
    "q": "Which country lost two World Cup finals in the 1970s?",
    "a": "Netherlands"
  },
  {
    "q": "Who is Africa’s top scorer at World Cup tournaments?",
    "a": "Asamoah Gyan"
  },
  {
    "q": "Which club plays its home games at San Siro?",
    "a": "AC Milan and Inter Milan"
  },
  {
    "q": "Who won the World Cup Golden Boot in 1998?",
    "a": "Davor Šuker"
  },
  {
    "q": "Which player is nicknamed 'The Pharaoh'?",
    "a": "Mohamed Salah"
  },
  {
    "q": "Who is the all-time leading scorer in the UEFA Champions League?",
    "a": "Cristiano Ronaldo"
  },
  {
    "q": "Which two countries have played the most World Cup matches against each other?",
    "a": "Brazil and Sweden"
  },
  {
    "q": "In what city would you find the stadium La Bombonera?",
    "a": "Buenos Aires"
  },
  {
    "q": "Which club was known as 'The Invincibles' in 2003-04?",
    "a": "Arsenal"
  },
  {
    "q": "Which country has reached three World Cup finals but never won?",
    "a": "Netherlands"
  },
  {
    "q": "Who managed Manchester United from 1986 to 2013?",
    "a": "Sir Alex Ferguson"
  },
  {
    "q": "Which club's fans are called The Kop?",
    "a": "Liverpool"
  },
  {
    "q": "Which player has the most appearances at FIFA World Cups?",
    "a": "Lothar Matthäus (25 appearances)"
  },
  {
    "q": "Which nation was the first to win the Euro and World Cup back-to-back?",
    "a": "Spain"
  },
  {
    "q": "Who scored the famous ‘ghost goal’ in the 1966 World Cup final?",
    "a": "Geoff Hurst"
  },
  {
    "q": "Who holds the record for most international hat-tricks?",
    "a": "Cristiano Ronaldo"
  },
  {
    "q": "Which African country knocked Spain out of the 2022 World Cup?",
    "a": "Morocco"
  },
  {
    "q": "Which footballer was once purchased for a world record transfer fee by Real Madrid in 2009?",
    "a": "Cristiano Ronaldo"
  },
  {
    "q": "Who has won the most FIFA Women’s World Cup titles?",
    "a": "USA"
  },
  {
    "q": "Which German striker is the all-time top scorer in World Cup tournaments?",
    "a": "Miroslav Klose"
  },
  {
    "q": "Who was Barcelona’s manager for most of the tiki-taka era?",
    "a": "Pep Guardiola"
  },
  {
    "q": "Which Asian nation reached the semi-finals of the 2002 World Cup?",
    "a": "South Korea"
  },
  {
    "q": "Which French club won the first ever European Cup (now Champions League) in 1956?",
    "a": "Trick question: it was Real Madrid (Spanish), not French!"
  },
  {
    "q": "Who scored the winning goal in the 2014 FIFA World Cup Final?",
    "a": "Mario Götze"
  },
  {
    "q": "Which team has won the most Copa Libertadores titles?",
    "a": "Independiente (Argentina)"
  },
  {
    "q": "Who is the youngest player to play in a FIFA World Cup match?",
    "a": "Norman Whiteside (17 years, 41 days – 1982)"
  },
  {
    "q": "Which country has produced the most Ballon d'Or winners?",
    "a": "Germany"
  },
  {
    "q": "Who was the first goalkeeper to win FIFA's Best Player award?",
    "a": "Lev Yashin"
  },
  {
    "q": "Which English club has the most top-flight league titles?",
    "a": "Manchester United"
  },
  {
    "q": "Who is known as 'Captain Fantastic' at Liverpool?",
    "a": "Steven Gerrard"
  },
  {
    "q": "Who is AC Milan's all-time leading scorer?",
    "a": "Gunnar Nordahl"
  },
  {
    "q": "Which club is famous for the yellow wall?",
    "a": "Borussia Dortmund"
  },
  {
    "q": "Which African player won the Ballon d'Or in 1995?",
    "a": "George Weah"
  },
  {
    "q": "Which country won the first ever UEFA European Championship?",
    "a": "Soviet Union (1960)"
  },
  {
    "q": "Who is Arsenal's all-time leading scorer?",
    "a": "Thierry Henry"
  },
  {
    "q": "What is the nickname of the Argentina national team?",
    "a": "La Albiceleste"
  },
  {
    "q": "Which country hosted the 2002 FIFA World Cup?",
    "a": "Japan and South Korea"
  },
  {
    "q": "Who scored a record five goals in one Champions League game in 2012?",
    "a": "Lionel Messi"
  },
  {
    "q": "Which club’s fans are called 'Los Blancos'?",
    "a": "Real Madrid"
  },
  {
    "q": "Which English player missed a penalty in the 1996 Euro semifinal against Germany?",
    "a": "Gareth Southgate"
  },
  {
    "q": "Which Asian country has played the most World Cups?",
    "a": "South Korea"
  },
  {
    "q": "Who is known as the 'Egyptian King' at Liverpool?",
    "a": "Mohamed Salah"
  },
  {
    "q": "Which club did Cristiano Ronaldo join after leaving Real Madrid?",
    "a": "Juventus"
  },
  {
    "q": "What is the nickname given to the Brazil national team?",
    "a": "Seleção or Seleção Canarinha"
  },
  {
    "q": "Who scored the Premier League's fastest hat-trick?",
    "a": "Sadio Mané (2 mins 56 secs, 2015)"
  },
  {
    "q": "Which German club has the most Bundesliga titles?",
    "a": "Bayern Munich"
  },
  {
    "q": "Who holds the record for most assists in a single Premier League season?",
    "a": "Kevin De Bruyne (21, tied with Thierry Henry)"
  },
  {
    "q": "Who is the most-capped international player ever?",
    "a": "Cristiano Ronaldo"
  },
  {
    "q": "Who was the first African nation to reach the World Cup quarter-finals?",
    "a": "Cameroon (1990)"
  },
  {
    "q": "Which player scored the 'Goal of the Century' in 1986 World Cup?",
    "a": "Diego Maradona"
  },
  {
    "q": "Which club did Zlatan Ibrahimović win his first Champions League with?",
    "a": "He never won the Champions League!"
  },
  {
    "q": "Which country has won the most Africa Cup of Nations titles?",
    "a": "Egypt"
  },
  {
    "q": "Who is the youngest goalscorer in World Cup history?",
    "a": "Pelé"
  },
  {
    "q": "Which club did Pep Guardiola play for as a footballer?",
    "a": "Barcelona"
  },
  {
    "q": "Who scored the most goals in a single World Cup tournament?",
    "a": "Just Fontaine (13 goals, 1958)"
  },
  {
    "q": "Who is Juventus' all-time leading appearance maker?",
    "a": "Alessandro Del Piero"
  },
  {
    "q": "Which country was disqualified from World Cup 1994 for match-fixing?",
    "a": "Togo (trick: actually, no big team was—try 'None')"
  },
  {
    "q": "Which Portuguese icon was known as 'The Black Panther'?",
    "a": "Eusébio"
  },
  {
    "q": "Which women's national team won the first Women’s World Cup in 1991?",
    "a": "USA"
  },
  {
    "q": "Who scored the winning penalty for Italy at Euro 2020?",
    "a": "Jorginho (semis), but final winner was converted after a miss, then by Italy's Donnarumma save."
  },
  {
    "q": "Which famous Italian stadium is also known as ‘La Scala del Calcio’?",
    "a": "San Siro"
  },
  {
    "q": "Who is the highest-scoring defender in football history?",
    "a": "Ronald Koeman"
  },
  {
    "q": "Which country’s national team is known as 'The Three Lions'?",
    "a": "England"
  },
  {
    "q": "Which South American club is nicknamed 'Flu'?",
    "a": "Fluminense"
  },
  {
    "q": "In which city does the football club River Plate play?",
    "a": "Buenos Aires"
  },
  {
    "q": "Which Scottish club did Henrik Larsson star for?",
    "a": "Celtic"
  },
  {
    "q": "Who scored the most headed goals in Premier League history?",
    "a": "Peter Crouch"
  },
  {
    "q": "Who is known as the 'King of Rome' among A.S. Roma fans?",
    "a": "Francesco Totti"
  },
  {
    "q": "Which MLS team does Lionel Messi play for as of 2024?",
    "a": "Inter Miami"
  },
  {
    "q": "What position did Manuel Neuer help redefine in the 2010s?",
    "a": "Sweeper keeper"
  },
  {
    "q": "Who was awarded the 2023 Ballon d'Or?",
    "a": "Lionel Messi"
  },
  {
    "q": "Which club did David Beckham join after leaving Manchester United?",
    "a": "Real Madrid"
  },
  {
    "q": "Who was the manager of Arsenal’s 'Invincibles' season?",
    "a": "Arsène Wenger"
  },
  {
    "q": "Which Polish striker won the 2021 FIFA Best Men's Player award?",
    "a": "Robert Lewandowski"
  },
  {
    "q": "Which country hosted the FIFA World Cup in 1998?",
    "a": "France"
  },
  {
    "q": "Which Asian club has won the most AFC Champions League titles?",
    "a": "Al-Hilal (Saudi Arabia)"
  },
  {
    "q": "Who is the most capped player for the Spain national team?",
    "a": "Sergio Ramos"
  },
  {
    "q": "Which German club is nicknamed 'Die Borussen'?",
    "a": "Borussia Dortmund"
  },
  {
    "q": "Who is the top goal scorer for the US Men's National Team?",
    "a": "Clint Dempsey and Landon Donovan (tied)"
  },
  {
    "q": "Which French striker scored in both the 1998 and 2006 World Cup finals?",
    "a": "Zinedine Zidane"
  },
  {
    "q": "What is the nickname of the Australian men's national team?",
    "a": "Socceroos"
  },
  {
    "q": "Which country has reached the most Copa America finals?",
    "a": "Uruguay"
  },
  {
    "q": "Who scored the fastest ever Premier League goal?",
    "a": "Shane Long (7.69 seconds, 2019)"
  },
  {
    "q": "In which year did Portugal win their first major international trophy?",
    "a": "2016 (UEFA Euro)"
  },
  {
    "q": "Which English club once went 49 games unbeaten in the league?",
    "a": "Arsenal"
  },
  {
    "q": "Which nation won Olympic gold in men’s football at London 2012?",
    "a": "Mexico"
  },
  {
    "q": "Who is the only player with goals scored in four different World Cup finals?",
    "a": "Pelé"
  },
  {
    "q": "Which European club has won the most domestic league titles?",
    "a": "Rangers FC (Scotland)"
  },
  {
    "q": "Who scored the 'Aguerooooo' league-winning goal in 2012?",
    "a": "Sergio Agüero"
  },
  {
    "q": "Which African player was nicknamed 'The Lion King'?",
    "a": "Roger Milla"
  },
  {
    "q": "Who was Chelsea FC’s manager during their first Premier League title?",
    "a": "José Mourinho"
  },
  {
    "q": "Which country won three European Championships (Euros)?",
    "a": "Germany"
  },
  {
    "q": "Which Italian striker was top scorer at Euro 2020?",
    "a": "Cristiano Ronaldo (Portugal, due to more assists)"
  },
  {
    "q": "What legendary club did Brian Clough lead to two consecutive European Cups?",
    "a": "Nottingham Forest"
  },
  {
    "q": "Which player scored in two consecutive Champions League finals (2014, 2016)?",
    "a": "Sergio Ramos"
  },
  {
    "q": "Who won the FIFA World Player of the Year in 1993 as the first African winner?",
    "a": "George Weah"
  },
  {
    "q": "Which Scottish club has a green and white hooped kit?",
    "a": "Celtic"
  },
  {
    "q": "Who is Leeds United's all-time top scorer?",
    "a": "Peter Lorimer"
  },
  {
    "q": "Who was known for the scorpion kick save against England in 1995?",
    "a": "René Higuita"
  },
  {
    "q": "Which country won the first edition ever of the African Cup of Nations?",
    "a": "Egypt"
  },
  {
    "q": "Which national team is known as 'The Oranje'?",
    "a": "Netherlands"
  },
  {
    "q": "Who did Argentina defeat in the 1986 World Cup final?",
    "a": "West Germany"
  },
  {
    "q": "Which country won Copa America as both hosts and champions in 2019?",
    "a": "Brazil"
  },
  {
    "q": "Who is the highest scoring defender in Champions League history?",
    "a": "Sergio Ramos"
  },
  {
    "q": "Which African player starred for Chelsea and scored the winning penalty in the 2012 Champions League final?",
    "a": "Didier Drogba"
  },
  {
    "q": "Which Asian team reached the quarter-finals of the 1994 World Cup?",
    "a": "Saudi Arabia"
  },
  {
    "q": "Who scored the first golden goal in a World Cup?",
    "a": "Laurent Blanc (France, 1998)"
  },
  {
    "q": "Which U.S. club did Thierry Henry finish his career with?",
    "a": "New York Red Bulls"
  },
  {
    "q": "Which European Cup final is remembered for 'the miracle of Istanbul'?",
    "a": "Liverpool vs. AC Milan (2005)"
  },
  {
    "q": "Who is the highest scorer in the history of the Bundesliga?",
    "a": "Gerd Müller"
  },
  {
    "q": "Which Spanish club did Diego Simeone manage to their first La Liga win in 18 years?",
    "a": "Atletico Madrid"
  },
  {
    "q": "What year was the Video Assistant Referee (VAR) first used at a FIFA World Cup?",
    "a": "2018"
  },
  {
    "q": "What is the maximum number of players allowed on a football pitch at one time?",
    "a": "22"
  },
  {
    "q": "Which English club is nicknamed 'The Citizens'?",
    "a": "Manchester City"
  },
  {
    "q": "Who scored the infamous Hand of God goal against England in 1986?",
    "a": "Diego Maradona"
  },
  {
    "q": "Which South American country has produced stars like Zico, Romário, and Ronaldinho?",
    "a": "Brazil"
  },
  {
    "q": "Which country, other than Brazil, has won five FIFA U-20 World Cups?",
    "a": "Argentina"
  },
  {
    "q": "Who was the first player to score a hat-trick in a World Cup final?",
    "a": "Geoff Hurst"
  },
  {
    "q": "Which club's fans are often called 'Toffees'?",
    "a": "Everton"
  },
  {
    "q": "Which European city has hosted the most European Cup/Champions League finals?",
    "a": "London"
  },
  {
    "q": "Which African club has won the most CAF Champions League titles?",
    "a": "Al Ahly (Egypt)"
  },
  {
    "q": "Who was the first substitute ever to score in a World Cup final?",
    "a": "Mario Götze (2014)"
  },
  {
    "q": "Which club was the first English team to win the European Cup?",
    "a": "Manchester United (1968)"
  },
  {
    "q": "At which stadium was the 1950 World Cup final famously played?",
    "a": "Maracanã"
  },
  {
    "q": "Which Hungarian forward scored four goals in the 1953 'Match of the Century' at Wembley?",
    "a": "Ferenc Puskás"
  },
  {
    "q": "Who is the only player to win the World Cup, Champions League, and Ballon d'Or in the same year?",
    "a": "Sir Bobby Charlton (1966)"
  },
  {
    "q": "Which CONCACAF team went furthest in a men's World Cup?",
    "a": "United States (semifinals, 1930)"
  },
  {
    "q": "Which referee infamously showed Robbie Fowler two yellow cards but didn’t send him off in 1996?",
    "a": "Gerard Ashby"
  },
  {
    "q": "Which club was known as 'The Bank of England club' for big spending in the 1950s?",
    "a": "Sunderland"
  },
  {
    "q": "Which team did Leicester City beat 9-0 away in the 2019-20 Premier League season?",
    "a": "Southampton"
  },
  {
    "q": "Who is the only player to score goals in FA Cup, League Cup, Champions League and World Cup finals?",
    "a": "Geoff Hurst"
  },
  {
    "q": "Who managed both Real Madrid and Barcelona?",
    "a": "Vicente del Bosque (youth at Barcelona; main at Real Madrid), but more famously Luis Enrique managed both as player and manager."
  },
  {
    "q": "Which country suffered a 7-1 defeat at home in a World Cup semifinal?",
    "a": "Brazil (vs. Germany, 2014)"
  },
  {
    "q": "Which club has played in the most different national top divisions?",
    "a": "Derry City (Northern Ireland and Republic of Ireland leagues)"
  },
  {
    "q": "Who scored the first ever Premier League goal?",
    "a": "Brian Deane"
  },
  {
    "q": "Which African nation withdrew from the 1966 World Cup in protest of qualification rules?",
    "a": "All African nations withdrew"
  },
  {
    "q": "Who was the first manager to win the Champions League with two different clubs?",
    "a": "Ernst Happel"
  },
  {
    "q": "Which club did Fernando Redondo represent in La Liga and Serie A?",
    "a": "Real Madrid (La Liga), AC Milan (Serie A)"
  },
  {
    "q": "Which two countries contested the first recognized international football match?",
    "a": "Scotland and England (1872)"
  },
  {
    "q": "Which World Cup saw the introduction of the penalty shootout?",
    "a": "1982 (used in semi-finals for the first time)"
  },
  {
    "q": "Which European club was first to win a Treble (League, Domestic Cup, European Cup) in a single season?",
    "a": "Celtic (1966-67)"
  },
  {
    "q": "Who provided the famous commentary line ‘They think it’s all over. It is now!’ during the 1966 final?",
    "a": "Kenneth Wolstenholme"
  },
  {
    "q": "The fastest red card in football history (in 2 seconds) was shown to which player?",
    "a": "Lee Todd"
  },
  {
    "q": "Who is the only Scottish manager to win the European Cup?",
    "a": "Jock Stein"
  },
  {
    "q": "Who completed the first ever bicycle kick goal in a World Cup?",
    "a": "Manuel Negrete (Mexico, 1986)"
  },
  {
    "q": "Which European club was the first to reach 100 European goals?",
    "a": "Real Madrid"
  },
  {
    "q": "Who is the only goalkeeper to score a golden goal at the Olympics?",
    "a": "Mohamed Al-Deayea"
  },
  {
    "q": "Who was the only player to receive a red card in the 2018 FIFA World Cup final?",
    "a": "None – no red cards in that final"
  },
  {
    "q": "Who was the first Asian club to make the Club World Cup final?",
    "a": "Kashima Antlers (Japan, 2016)"
  },
  {
    "q": "Which club’s anthem is 'Blowing Bubbles'?",
    "a": "West Ham United"
  },
  {
    "q": "What is the only country to have reached the World Cup, Cricket World Cup, and Rugby World Cup finals?",
    "a": "England"
  },
  {
    "q": "Who was the first player to score in five separate World Cup tournaments?",
    "a": "Cristiano Ronaldo"
  },
  {
    "q": "Who is the all-time top scorer in the Africa Cup of Nations?",
    "a": "Samuel Eto'o"
  },
  {
    "q": "Which club won the first ever European Cup (now Champions League) title?",
    "a": "Real Madrid"
  },
  {
    "q": "Who is the first and only player to score in 11 consecutive Champions League games?",
    "a": "Cristiano Ronaldo"
  },
  {
    "q": "Which country won the first UEFA Nations League tournament?",
    "a": "Portugal"
  },
  {
    "q": "Which player famously scored a hat-trick of penalties in a single World Cup match?",
    "a": "Geoff Hurst (1966; but the only 3-penalty hat trick is Cristiano Ronaldo vs Spain, 2018 – clarify as needed!)"
  },
  {
    "q": "Which country is the only team to have played at every World Cup?",
    "a": "Brazil"
  },
  {
    "q": "Who scored the quickest Champions League hat-trick?",
    "a": "Bafétimbi Gomis (8 minutes, 2011)"
  },
  {
    "q": "Which Italian club did Gabriel Batistuta join in 2000 after years with Fiorentina?",
    "a": "AS Roma"
  },
  {
    "q": "Who was the first female Ballon d’Or winner?",
    "a": "Ada Hegerberg"
  },
  {
    "q": "In what year was the back-pass rule introduced in football?",
    "a": "1992"
  },
  {
    "q": "Which Swedish club did Zlatan Ibrahimović start his professional career?",
    "a": "Malmö FF"
  },
  {
    "q": "Which French manager led Chelsea to their first Champions League title?",
    "a": "Roberto Di Matteo"
  },
  {
    "q": "What was the first World Cup to use VAR technology?",
    "a": "2018"
  },
  {
    "q": "Which club is known as 'The Old Lisbon Lions'?",
    "a": "Celtic (1966-67)"
  },
  {
    "q": "Which Spanish player won four consecutive Champions League titles with Real Madrid?",
    "a": "Sergio Ramos"
  },
  {
    "q": "Who scored the 100th goal in World Cup history?",
    "a": "Leônidas da Silva (Brazil, 1938)"
  },
  {
    "q": "Which player scored the first ever goal in Major League Soccer (MLS)?",
    "a": "Eric Wynalda"
  },
  {
    "q": "Who won the first ever FIFA U-20 World Cup (1977)?",
    "a": "Soviet Union"
  },
  {
    "q": "What is the smallest country by population to qualify for a men’s World Cup?",
    "a": "Iceland"
  },
  {
    "q": "Which women's national team was the first to win back-to-back FIFA World Cups?",
    "a": "USA"
  },
  {
    "q": "Which English club has the most FA Cup wins?",
    "a": "Arsenal"
  },
  {
    "q": "Who scored the 'Hand of God' goal in women's football at the 2007 World Cup quarters?",
    "a": "Abby Wambach"
  },
  {
    "q": "Which country did 'El Matador' Edinson Cavani represent?",
    "a": "Uruguay"
  },
  {
    "q": "Who is known as 'Il Capitano' at Roma?",
    "a": "Francesco Totti"
  },
  {
    "q": "Which African club is based in Casablanca and known for fierce local derbies?",
    "a": "Wydad Casablanca"
  },
  {
    "q": "Who was awarded the 1998 FIFA World Cup Golden Ball?",
    "a": "Ronaldo (Brazil)"
  },
  {
    "q": "Which club holds the record for longest undefeated run in top European leagues (all comps)?",
    "a": "AC Milan (58 games, 1991–1993)"
  },
  {
    "q": "Which country won Copa America 2001 without conceding a single goal?",
    "a": "Colombia"
  },
  {
    "q": "Who scored for Denmark in the Euro 1992 final to seal the win?",
    "a": "Kim Vilfort"
  },
  {
    "q": "Which club did Dennis Bergkamp start his professional career with?",
    "a": "Ajax"
  },
  {
    "q": "What is the highest number of goals scored in a single World Cup game?",
    "a": "Austria 7–5 Switzerland (1954, 12 goals)"
  },
  {
    "q": "Which former Ballon d'Or winner served as Liberia’s president?",
    "a": "George Weah"
  },
  {
    "q": "Who scored the fastest goal in UEFA Champions League history?",
    "a": "Roy Makaay (10.12 seconds)"
  },
  {
    "q": "Which Asian country won the AFC Asian Cup four times?",
    "a": "Japan"
  },
  {
    "q": "Which player wore the number 10 shirt for the Netherlands in the 1974 World Cup?",
    "a": "Johan Cruyff"
  },
  {
    "q": "What is the only country to win back-to-back Women's Euro titles since 1990?",
    "a": "Germany"
  },
  {
    "q": "Who is the all-time leading scorer for Bayern Munich?",
    "a": "Gerd Müller"
  },
  {
    "q": "Which club did Alan Shearer win his only Premier League title with?",
    "a": "Blackburn Rovers"
  },
  {
    "q": "Which international team’s home stadium is Hampden Park?",
    "a": "Scotland"
  },
  {
    "q": "Which club won the first ever European Cup Winners' Cup in 1961?",
    "a": "Fiorentina"
  },
  {
    "q": "Who is the most capped French international of all time?",
    "a": "Lilian Thuram"
  },
  {
    "q": "Which team has played the most matches at the World Cup finals without ever winning it?",
    "a": "Netherlands"
  },
  {
    "q": "What was the first African nation to score in a FIFA World Cup tournament?",
    "a": "Egypt"
  },
  {
    "q": "Which Norwegian club shocked Real Madrid with a 2-0 win in 1995 Champions League?",
    "a": "Rosenborg"
  },
  {
    "q": "Who was top scorer at UEFA Women’s Euro 2017?",
    "a": "Jodie Taylor"
  },
  {
    "q": "What club is nicknamed 'The Toffees'?",
    "a": "Everton"
  },
  {
    "q": "Which Premier League team has an actual moose on its badge?",
    "a": "Watford"
  },
  {
    "q": "Who was the captain of the 1966 West Germany World Cup team?",
    "a": "Uwe Seeler"
  },
  {
    "q": "Who scored both goals in the 1974 World Cup final defeat for the Netherlands?",
    "a": "Paul Breitner and Gerd Müller"
  },
  {
    "q": "Which national team is known as 'The Elephants'?",
    "a": "Ivory Coast"
  },
  {
    "q": "What club did Diego Forlán win the Europa League with?",
    "a": "Atlético Madrid"
  },
  {
    "q": "Which player has played and scored in five different European Championship tournaments?",
    "a": "Cristiano Ronaldo"
  },
  {
    "q": "Which MLS club is nicknamed 'The Sounders'?",
    "a": "Seattle Sounders FC"
  },
  {
    "q": "Which current African stadium has the largest official capacity?",
    "a": "FNB Stadium (South Africa, aka Soccer City)"
  },
  {
    "q": "Who was the first English club to win a major European trophy?",
    "a": "Tottenham Hotspur (Cup Winners' Cup 1963)"
  },
  {
    "q": "Which goalkeeper won the 2021 Yashin Trophy?",
    "a": "Gianluigi Donnarumma"
  },
  {
    "q": "Who scored in both the 2002 and 2006 World Cup finals?",
    "a": "Zinedine Zidane"
  },
  {
    "q": "Which country won the 2016 Olympic men’s football gold medal?",
    "a": "Brazil"
  },
  {
    "q": "Which national team was led by coach Bora Milutinović at five different World Cups?",
    "a": "Mexico, Costa Rica, USA, Nigeria, China"
  },
  {
    "q": "Who became the first player to win Premier League titles at two different Manchester clubs?",
    "a": "Carlos Tevez"
  },
  {
    "q": "Which club did Ruud Gullit first manage in the English Premier League?",
    "a": "Chelsea"
  },
  {
    "q": "What is the name of the cup contested between Boca Juniors and River Plate?",
    "a": "Superclásico"
  },
  {
    "q": "Who is the only player to have captained and managed his country in a World Cup final?",
    "a": "Didier Deschamps"
  },
  {
    "q": "Which club won the first treble of league, national cup, and European Cup in the 21st century?",
    "a": "Manchester United (1998–99)"
  },
  {
    "q": "Which South American nation won a Copa America in their centenary year, 2016?",
    "a": "Chile"
  },
  {
    "q": "Which men's international coach took two countries to World Cup finals, winning one?",
    "a": "Carlos Alberto Parreira (Brazil 1994 win; Kuwait, Saudi Arabia, South Africa also managed)"
  },
  {
    "q": "Who was the first player to score in five different World Cup tournaments?",
    "a": "Marta (Brazil, Women's World Cup)"
  },
  {
    "q": "Which club did Gabriel Batistuta play for in Qatar?",
    "a": "Al-Arabi"
  },
  {
    "q": "Which city hosted both men's and women's World Cup finals?",
    "a": "Los Angeles (Rose Bowl: 1994 men's, 1999 women's)"
  },
  {
    "q": "Who won the first ever FIFA Puskás Award for best goal?",
    "a": "Cristiano Ronaldo"
  },
  {
    "q": "Which African keeper saved penalties from both Diego Maradona and Michel Platini?",
    "a": "Joseph-Antoine Bell"
  },
  {
    "q": "In which World Cup did the 'golden goal' rule first decide a match?",
    "a": "1998 (France vs. Paraguay, Laurent Blanc)"
  },
  {
    "q": "Which women's club has the most UEFA Women's Champions League titles?",
    "a": "Olympique Lyonnais Féminin"
  },
  {
    "q": "Who was known as the 'Minister of Defense' in Italian football?",
    "a": "Franco Baresi"
  },
  {
    "q": "Which club hired Marcello Lippi after he won the 2006 World Cup?",
    "a": "Guangzhou Evergrande (China)"
  },
  {
    "q": "Which Asian country reached the last 8 at the Women's World Cup before the men's team did?",
    "a": "China (1995 Women’s, men never)"
  },
  {
    "q": "Which stadium is often called the 'Cathedral' of Brazilian football?",
    "a": "Maracanã"
  },
  {
    "q": "Which club won the first FIFA Club World Cup in 2000?",
    "a": "Corinthians"
  },
  {
    "q": "Who holds the Spanish record for most club goals in a single top flight season?",
    "a": "Lionel Messi (50, 2011–12)"
  },
  {
    "q": "Who scored Italy's only goal in the 2006 World Cup final shootout?",
    "a": "Marco Materazzi"
  },
  {
    "q": "Which country's national team wears a star for each World Cup qualification, not wins?",
    "a": "Australia (one star for each qualification)"
  },
  {
    "q": "Who scored the last-minute winner for Manchester United in the 1999 UCL final?",
    "a": "Ole Gunnar Solskjær"
  },
  {
    "q": "Which two clubs are referred to as 'The Old Firm'?",
    "a": "Celtic and Rangers"
  },
  {
    "q": "What is the only country to have its national league suspended for volcanic ash?",
    "a": "Iceland"
  },
  {
    "q": "Which Portuguese stadium hosted the 2004 UEFA Euro final?",
    "a": "Estádio da Luz"
  },
  {
    "q": "What is the maximum number of yellow cards shown to a single player in one World Cup match?",
    "a": "Three (Graham Poll vs. Croatia 2006, error!)"
  },
  {
    "q": "Who was the Argentine manager at the 'Battle of Santiago' in the 1962 World Cup?",
    "a": "Juan Carlos Lorenzo"
  },
  {
    "q": "Which Dutch club won the first UEFA Cup (now Europa League) in 1972?",
    "a": "Ajax"
  },
  {
    "q": "Who scored the only goal in the 1990 World Cup final?",
    "a": "Andreas Brehme"
  },
  {
    "q": "Which French striker set a record with nine goals at the 1958 World Cup?",
    "a": "Just Fontaine"
  },
  {
    "q": "Who is known as 'Der Kaiser'?",
    "a": "Franz Beckenbauer"
  },
  {
    "q": "Which country’s women's team went closest to winning but lost three Women’s World Cup finals?",
    "a": "Sweden"
  },
  {
    "q": "Which club did Ruud van Nistelrooy join after leaving Manchester United?",
    "a": "Real Madrid"
  },
  {
    "q": "What is the largest margin of victory in a World Cup final?",
    "a": "5 goals (Brazil 5–2 Sweden, 1958)"
  },
  {
    "q": "Who was the first African coach to win the African Cup of Nations after coaching abroad?",
    "a": "Stephen Keshi"
  },
  {
    "q": "Which player scored in a Champions League quarter-final, semi-final, and final in the same year twice?",
    "a": "Cristiano Ronaldo"
  },
  {
    "q": "What country hosted the only indoor FIFA World Cup match?",
    "a": "United States (Pontiac Silverdome, 1994)"
  },
  {
    "q": "Who became Africa's youngest World Cup goalscorer in 2022?",
    "a": "Gavi (Spain, but actually African is Femi Opabunmi, 17, Nigeria, 2002)"
  },
  {
    "q": "Which Asian club reached the UCL semi-final (European) in 1985-86?",
    "a": "None. Only European clubs have participated."
  },
  {
    "q": "Which club suffered defeat in both the first and most recent FIFA Club World Cup finals?",
    "a": "Vasco da Gama (2000), Flamengo (2019)"
  },
  {
    "q": "Where was the first official penalty shootout in international football held?",
    "a": "Florence, Italy, Euro 1968 semifinal"
  },
  {
    "q": "Who won the Intercontinental Cup three times as a player?",
    "a": "Paolo Maldini"
  },
  {
    "q": "Which English club played its home matches at Priestfield Stadium after a stadium ban?",
    "a": "Brighton & Hove Albion"
  },
  {
    "q": "Who was the first player to score at five FIFA World Cup tournaments?",
    "a": "Marta (Women’s), Cristiano Ronaldo (Men’s)"
  },
  {
    "q": "Which stadium is known as 'The Temple' by fans?",
    "a": "Signal Iduna Park (Dortmund)"
  },
  {
    "q": "What is the only country to win three consecutive Olympic men's football gold medals?",
    "a": "Hungary (1952, 1964, 1968)"
  },
  {
    "q": "Who scored the decisive penalty for Portugal at Euro 2016?",
    "a": "Ricardo Quaresma"
  },
  {
    "q": "Which Turkish club's home is known as 'Hell' by fans?",
    "a": "Galatasaray"
  },
  {
    "q": "Who set a La Liga record for most assists in one season (20 in 2020-21)?",
    "a": "Iago Aspas"
  },
  {
    "q": "Which Asian club has featured in more than 10 AFC Champions League finals?",
    "a": "Al Hilal (Saudi Arabia)"
  },
  {
    "q": "What was the result of the 2005 African Champions League final second leg that led to a penalty shootout win for Al Ahly?",
    "a": "1–1 draw; penalties"
  },
  {
    "q": "Name the first female footballer to play in a men’s professional football match in England.",
    "a": "Hayley McQueen"
  },
  {
    "q": "Which Brazilian club is famously known for developing Pelé?",
    "a": "Santos"
  },
  {
    "q": "Who was captain of Spain’s 2010 World Cup-winning team?",
    "a": "Iker Casillas"
  },
  {
    "q": "Which club lost the 2001 Champions League final on penalties to Bayern Munich?",
    "a": "Valencia"
  },
  {
    "q": "Which South American country has never qualified for a men's World Cup?",
    "a": "Venezuela"
  },
  {
    "q": "Who scored the winning penalty for Italy in the 2006 World Cup Final shootout?",
    "a": "Fabio Grosso"
  },
  {
    "q": "Which Scottish team did Sir Alex Ferguson manage before Aberdeen?",
    "a": "St. Mirren"
  },
  {
    "q": "Who scored both goals for Uruguay in the 1950 World Cup Final upset?",
    "a": "Juan Alberto Schiaffino and Alcides Ghiggia"
  },
  {
    "q": "Which country did Ossie Ardiles win the World Cup with?",
    "a": "Argentina"
  },
  {
    "q": "Which English striker was top scorer at the 1986 World Cup?",
    "a": "Gary Lineker"
  },
  {
    "q": "Which club is known as 'La Vecchia Signora' in Italy?",
    "a": "Juventus"
  },
  {
    "q": "Which African team became the first to reach the Women's World Cup knockout stage?",
    "a": "Nigeria"
  },
  {
    "q": "Who was the youngest ever Premier League player?",
    "a": "Harvey Elliott (Fulham, 16y 30d)"
  },
  {
    "q": "Which English club did Ruud Gullit win the FA Cup with as player-manager?",
    "a": "Chelsea"
  },
  {
    "q": "Who scored the last goal at Highbury before Arsenal moved to Emirates Stadium?",
    "a": "Dennis Bergkamp"
  },
  {
    "q": "Which Asian nation reached the final of the AFC Asian Cup in every decade since the 1960s?",
    "a": "Iran"
  },
  {
    "q": "Who holds the record for most goals in a single Serie A season?",
    "a": "Gonzalo Higuaín (36 goals, 2015-16)"
  },
  {
    "q": "What is the nickname of Ajax's youth academy?",
    "a": "De Toekomst (The Future)"
  },
  {
    "q": "Which club won the 2020 Copa Libertadores?",
    "a": "Palmeiras"
  },
  {
    "q": "Which player scored the first 'golden goal' in a European Championship final?",
    "a": "Oliver Bierhoff (Germany, 1996)"
  },
  {
    "q": "Which German club's fans are famous for singing 'You'll Never Walk Alone'?",
    "a": "Borussia Dortmund"
  },
  {
    "q": "Who scored the first official goal in the first-ever Women's World Cup match?",
    "a": "Ma Li (China, 1991)"
  },
  {
    "q": "Which European country won their only major title at Euro 2004?",
    "a": "Greece"
  },
  {
    "q": "What is the nickname of the Scottish national football team?",
    "a": "The Tartan Army"
  },
  {
    "q": "Who has won the most domestic 'double' titles in England?",
    "a": "Arsenal"
  },
  {
    "q": "Which French player became all-time top scorer at the European Championship finals?",
    "a": "Michel Platini"
  },
  {
    "q": "Which club did Alan Hansen captain to multiple European Cups?",
    "a": "Liverpool"
  },
  {
    "q": "In which city was the first ever FIFA World Cup match played?",
    "a": "Montevideo"
  },
  {
    "q": "Which Spanish player scored the last goal in the Euro 2012 final?",
    "a": "Juan Mata"
  },
  {
    "q": "Which country was World Cup runner-up in 1954?",
    "a": "Hungary"
  },
  {
    "q": "Which African country hosted the first FIFA U-17 World Cup?",
    "a": "China (trick: not Africa; the first African host was Egypt, 1997)"
  },
  {
    "q": "Which English club won the Cup Winners’ Cup in 1994?",
    "a": "Arsenal"
  },
  {
    "q": "What is the home stadium of Flamengo?",
    "a": "Maracanã"
  },
  {
    "q": "Who was the first Norwegian club to reach the Champions League group stage?",
    "a": "Rosenborg"
  },
  {
    "q": "Which country’s national stadium is named 'Estadio Centenario'?",
    "a": "Uruguay"
  },
  {
    "q": "Who is the only player to win the golden boot in World Cup and European Championship tournaments?",
    "a": "Gerd Müller"
  },
  {
    "q": "Which team is nicknamed 'The Pharaohs'?",
    "a": "Egypt"
  },
  {
    "q": "Which English club has the nickname 'The Baggies'?",
    "a": "West Bromwich Albion"
  },
  {
    "q": "What is the only team to win the UEFA Euro at their very first appearance?",
    "a": "Greece (2004)"
  },
  {
    "q": "Which Croatian striker scored in three different decades at the World Cup?",
    "a": "Davor Šuker"
  },
  {
    "q": "Who won Ballon d'Or and World Cup in the same year for Germany?",
    "a": "Lothar Matthäus (1990 Ballon d'Or, World Cup)"
  },
  {
    "q": "Which country lost three consecutive African Cup of Nations finals between 1962 and 1968?",
    "a": "Ethiopia"
  },
  {
    "q": "What is the nickname of the Belgian national football team?",
    "a": "The Red Devils"
  },
  {
    "q": "Which European club is nicknamed 'The Eagles'?",
    "a": "Benfica"
  },
  {
    "q": "Which country did the legendary Hristo Stoichkov represent?",
    "a": "Bulgaria"
  },
  {
    "q": "Who was Japan's first ever professional football manager?",
    "a": "Hans Ooft"
  },
  {
    "q": "Which player holds the record for the fastest goal ever scored in Serie A?",
    "a": "Rafael Leão (6.2 seconds)"
  },
  {
    "q": "Who is the youngest English player to start in a major tournament match?",
    "a": "Jude Bellingham"
  },
  {
    "q": "Which South American club's stadium is called 'La Olla'?",
    "a": "Club Cerro Porteño (Paraguay)"
  },
  {
    "q": "Who scored the final goal at the old Wembley Stadium?",
    "a": "Dietmar Hamann"
  },
  {
    "q": "Which Swedish striker was top scorer at Euro 2004?",
    "a": "Henrik Larsson"
  },
  {
    "q": "Which CONCACAF side won the Gold Cup three times in a row (1993, 1996, 1998)?",
    "a": "Mexico"
  },
  {
    "q": "Who is the only player in history to score in two European Cup finals for two different clubs?",
    "a": "Cristiano Ronaldo (Manchester United 2008, Real Madrid 2014)"
  },
  {
    "q": "Which two national teams have reached the most World Cup quarter-finals without ever reaching the final?",
    "a": "Mexico and Yugoslavia"
  },
  {
    "q": "Which Asian nation reached a continental cup final the most times without winning it?",
    "a": "Saudi Arabia (lost 3 times)"
  },
  {
    "q": "Name the first U.S. men's club to win the CONCACAF Champions League?",
    "a": "Seattle Sounders FC (2022)"
  },
  {
    "q": "Who was the first South American woman to win FIFA World Player of the Year?",
    "a": "Marta"
  },
  {
    "q": "Which club's fans are called 'The Canaries'?",
    "a": "Norwich City"
  },
  {
    "q": "Which European club is known as 'The Old Lady of Turin'?",
    "a": "Juventus"
  },
  {
    "q": "Who is the all-time top scorer in Portuguese top division history?",
    "a": "Fernando Peyroteo"
  },
  {
    "q": "Who scored the last minute penalty in the 2012 Champions League final?",
    "a": "Didier Drogba"
  },
  {
    "q": "Which club did Pavel Nedved spend most of his career with?",
    "a": "Juventus"
  },
  {
    "q": "What is the nickname of the Nigerian national football team?",
    "a": "Super Eagles"
  },
  {
    "q": "Which female goalkeeper is known as the Queen of Clean Sheets?",
    "a": "Hope Solo"
  },
  {
    "q": "Which nation became the first African side to win Olympic football gold?",
    "a": "Nigeria (1996 Atlanta)"
  }
]
